app/Http/Controllers/FrontEndController.php

            }


            $response = new \Illuminate\Http\Response(view('qrsaas.'.config('settings.qr_landing'), [
                'col'=>$colCounter[count($plans)],
                'plans'=>$plans,
                'features'=>$features,
                'availableLanguages'=>$availableLanguages,
                'locale'=>$locale,
                'pages'=>Pages::where('showAsLink', 1)->get(),
            ]));
---
select * from `pages` where `showAsLink` = 1

    public function restorant($alias)
    {

        //Do we have impressum app
        $doWeHaveImpressumApp=Module::has('impressum');


        $subDomain = $this->getSubDomain();
        if ($subDomain && $alias !== $subDomain) {
            return redirect()->route('restorant', $subDomain);
        }
        $restorant = Restorant::whereRaw('REPLACE(subdomain, "-", "") = ?', [str_replace("-","",$alias)])->first();

        //Set config based on restaurant
        config(['app.timezone' => $restorant->getConfig('time_zone',config('app.timezone'))]);


        if ($restorant->active == 1) {

            if(isset($_GET['pay'])){
                //This is a payment link
                $order=Order::findOrFail($_GET['pay']);
                if($order->restorant_id==$restorant->id){
                    return redirect($order->payment_link);
                }
            }

            $restorant->increment('views');

            $canDoOrdering = true;
            if (config('app.isqrsaas')) {
                //In QRsaas with plans, we need to check if they can add new items.
                $currentPlan = Plans::findOrFail($restorant->user->mplanid());
---
select * from `restorants` where REPLACE(subdomain, "-", "") = 'leukapizza' limit 1
update `restorants` set `views` = `views` + 1, `restorants`.`updated_at` = '2021-04-22 12:12:53' where `id` = 1
select * from `users` where `users`.`id` = 2 limit 1

            $previousOrderArray = array_filter(explode(',', $previousOrders));

            //tables
            $tables = Tables::where('restaurant_id', $restorant->id)->get();
---
select * from `tables` where `restaurant_id` = 1

           $formatter = new \IntlDateFormatter(config('app.locale'), \IntlDateFormatter::SHORT, \IntlDateFormatter::SHORT);
           $formatter->setPattern(config('settings.datetime_workinghours_display_format_new'));

            return view('restorants.show', [
                'doWeHaveImpressumApp'=>$doWeHaveImpressumApp,
                'restorant' => $restorant,
                'openingTime' => $businessHours->isClosed()?$formatter->format($businessHours->nextOpen($now)):null,
                'closingTime' => $businessHours->isOpen()?$formatter->format($businessHours->nextClose($now)):null,
                'usernames' => $usernames,
                'canDoOrdering'=>$canDoOrdering&&$businessHours->isOpen(),
                'currentLanguage'=>$currentEnvLanguage,
                'showLanguagesSelector'=>env('ENABLE_MILTILANGUAGE_MENUS', false) && $restorant->localmenus()->count() > 1,
                'hasGuestOrders'=>count($previousOrderArray) > 0,
                'fields'=>[['class'=>'col-12', 'classselect'=>'noselecttwo', 'ftype'=>'select', 'name'=>'Table', 'id'=>'table_id', 'placeholder'=>'Select table', 'data'=>$tablesData, 'required'=>true]],
            ]);
---
select * from `restorants` where REPLACE(subdomain, "-", "") = 'leukapizza' limit 1